-- ============================================================
-- Исследовательский анализ данных
-- ============================================================

-- ============================================================
-- 1. Исследование структуры данных.
-- ============================================================

-- ==========================================
-- Таблица банковских операций
-- ==========================================

-- Вопрос:
-- Какие столбцы есть в таблице?

SELECT
    column_name,
    data_type
FROM information_schema.columns
WHERE table_schema = 'finance'
    AND table_name = 'bank_transactions'
ORDER BY ordinal_position;

-- Таблица содержит 17 столбцов с числовыми, строковыми и временными типами данных.

---------------------------------------------------------------

-- Вопрос:
-- Сколько операций содержится в таблице?

SELECT COUNT(*) AS total_transactions  
FROM finance.bank_transactions;

-- Таблица содержит 555 операций.

---------------------------------------------------------------

-- Вопрос:
-- За какой период собраны данные?

SELECT 
    MIN(operation_date) AS first_operation,
    MAX(operation_date) AS last_operation
FROM finance.bank_transactions;

-- Данные охватывают период с 24.06.2025 по 22.06.2026 (около 12 месяцев).

---------------------------------------------------------------

-- Вопрос: 
-- Есть ли операции без даты?

SELECT
    COUNT(*) AS missing_operation_date
FROM finance.bank_transactions
WHERE operation_date IS NULL;

-- Операций без даты не выявлено.

-- ==========================================
-- Таблица макроэкономических показателей
-- ==========================================

-- Вопрос:
-- Какие столбцы есть в таблице?

SELECT
    column_name,
    data_type
FROM information_schema.columns
WHERE table_schema = 'finance'
    AND table_name = 'inflation'
ORDER BY ordinal_position;

-- Таблица содержит 4 столбца с типами данных date и numeric.

---------------------------------------------------------------

-- Вопрос:
-- Сколько периодов содержится в таблице?

SELECT COUNT(*) AS total_periods
FROM finance.inflation;

-- Таблица содержит 12 периодов с макроэкономическими показателями.

---------------------------------------------------------------

-- Вопрос:
-- За какой период собраны данные?

SELECT 
    MIN("period") AS first_operation,
    MAX("period") AS last_operation
FROM finance.inflation; 

-- Данные охватывают период с 2025-06-01 по 2026-05-01 (12 месяцев).

---------------------------------------------------------------

-- Вопрос: 
-- Есть ли периоды без даты?

SELECT
    COUNT(*) AS missing_period
FROM finance.inflation
WHERE "period" IS NULL;

-- Периодов без даты не выявлено.

